# 3. Задайте последовательность чисел.
# Напишите программу, которая выведет список неповторяющихся элементов исходной последовательности.
import numpy                # самый быстрый способ создания списка случайных чисел

initial_nums = list(numpy.random.randint(0, 10, 100))
print(set(initial_nums))
